In [1]:
import pandas as pd

In [18]:
dic = { "name" : ["Bob","Alex","Janice", "fuck"],
       "age" : [60, 25, 33, 44] }
df = pd.DataFrame(dic)
df

     name  age
0     Bob   60
1    Alex   25
2  Janice   33
3    fuck   44

In [19]:
df["age_plus_one"] = df["age"] + 1
df["age_times_two"] = 2 * df["age"]
df

     name  age  age_plus_one  age_times_two
0     Bob   60            61            120
1    Alex   25            26             50
2  Janice   33            34             66
3    fuck   44            45             88

In [24]:
total_age = df["age"].sum()
median_age = df["age"].quantile(0.66)
total_age
median_age

43.78

In [26]:
df_below50 = df[df["age"] < 50]
df_below50

     name  age  age_plus_one  age_times_two
1    Alex   25            26             50
2  Janice   33            34             66
3    fuck   44            45             88

In [27]:
df["age_squared"] = df["age"].apply(lambda x: x*x)
df

In [32]:
df_w_name_as_ind = df.set_index("name")
df_w_name_as_ind

        age  age_plus_one  age_times_two  age_squared
name
Bob      60            61            120         3600
Alex     25            26             50          625
Janice   33            34             66         1089
fuck     44            45             88         1936

In [39]:
bobs_row = df_w_name_as_ind.ix["Bob"]
bobs_row

C:\Users\leedonguk\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

age                60
age_plus_one       61
age_times_two     120
age_squared      3600
Name: Bob, dtype: int64

In [54]:
dic_age = { "name" : ["Tom","Tyrell","Claire", "12", "1"],
        "age" : [60, 25, 33, 53, 11] }
df_w_age = pd.DataFrame(dic_age)
print(df_w_age)
dic_height = { "name" : ["Tom","Tyrell","Claire", "kfk"],
        "height" : [6.2, 4.0, 5.5, 4.4] }
df_w_height = pd.DataFrame(dic_height)
print(df_w_height)
joined = df_w_age.set_index("name").join(df_w_height.set_index("name"))
joined

     name  age
0     Tom   60
1  Tyrell   25
2  Claire   33
3      12   53
4       1   11
     name  height
0     Tom     6.2
1  Tyrell     4.0
2  Claire     5.5
3     kfk     4.4

        age  height
name
Tom      60     6.2
Tyrell   25     4.0
Claire   33     5.5
12       53     NaN
1        11     NaN

In [72]:
dic = { "name" : ["Tom","Tyrell","Claire"],
        "age" : [60, 25, 33], 
        "height" : [6.2, 4.0, 5.5],
        "gender" : ["M", "M", "f"] }
df = pd.DataFrame(dic)
print(df)
gender = df.groupby("gender")
print(gender.mean())
print(gender.quantile(0.5))
def agg(ddf):
    return pd.Series({
        "name" : max(ddf["name"]),
        "oldest" : max(ddf["age"]),
        "mean_height" : ddf["height"].mean()
        })
print(df.groupby("gender").apply(agg))

     name  age  height gender
0     Tom   60     6.2      M
1  Tyrell   25     4.0      M
2  Claire   33     5.5      f
         age  height
gender
M       42.5     5.1
f       33.0     5.5
0.5      age  height
gender
M       42.5     5.1
f       33.0     5.5
          name  oldest  mean_height
gender
M       Tyrell      60          5.1
f       Claire      33          5.5